[
    {
        "ratings": {
            "5 star": "56%",
            "4 star": "23%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "12%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "It charges quick like 4 hr is enough. It gives an output of 2400mah to the quick charge enabled moto photo which is the best ever. Continous charging like you connect the powerbank to wall charger and the phone to powerbank and you sleep by morning both will be ready full charge. I guarantee. Loved this product than any other electronic gadget i purchased recently it never lets you down",
                "review_posted_date": "12 Sep 2018",
                "review_header": "Best powerbank ever. Fast charging and continous charge amazing",
                "review_rating": "5.0 ",
                "review_author": "christopher"
            },
            {
                "review_comment_count": "",
                "review_text": "5 stars for the quick delivery and it is working well for now. I can fully charge one android phone of 3000 mah capacity and one iPhone 6s two times each in one recharge! That is value for money and keeps me sorted battery wise.",
                "review_posted_date": "09 Sep 2018",
                "review_header": "Good buy especially if you’re always on the go",
                "review_rating": "5.0 ",
                "review_author": "Dr. V"
            },
            {
                "review_comment_count": "",
                "review_text": "Waste of Money 1st day review * While discharging getting heats up little bit. * I think there should be a power on/off button. # Review After 9 days I am giving 1 out of 5 bcz the reasons are below : 1. I fully charged Mi power bank and wait for two days ideal (without connecting any device) -- found fully discharged after two days. 2. More time take to full charge 3. Heats up while connecting any device.",
                "review_posted_date": "23 Sep 2018",
                "review_header": "Waste of money",
                "review_rating": "1.0 ",
                "review_author": "SUJITH N P"
            },
            {
                "review_comment_count": "",
                "review_text": "This is one of the best as per money spent. Go for it.",
                "review_posted_date": "13 Jul 2018",
                "review_header": "Very good and efficient",
                "review_rating": "5.0 ",
                "review_author": "Abhishek"
            },
            {
                "review_comment_count": "",
                "review_text": "Its a nice product Mi 10000 2i power bank..very elegant design sleek,slim ,may be easily be kept in pocket but slightly heavier so practically not easy..however the working capacity looks pretty good as of now..it is getting fully charge in around 5 hours n charging my Iphone 5S(battery capacity around 1570mah) for about 4 & half times that makes its productive capacity to around 7500 mah,,(i dont know that this much of capacity is good or bad)..a more marked feature of this powerbank which I came across is that it is neither heating up during charging nor heating the phone when it charge..really a nice mi product actually a made in India product which is worth the price..",
                "review_posted_date": "22 Sep 2018",
                "review_header": "Good Power Bank",
                "review_rating": "4.0 ",
                "review_author": "Abhishek"
            },
            {
                "review_comment_count": "",
                "review_text": "good product for the price. Nice, convenient and sleek design. Works as advertised, satisfied with the product. It is just as advertised.",
                "review_posted_date": "01 Sep 2018",
                "review_header": "very good product.",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "I was expecting this to be a reliable product but what happened is this powerbank stopped charging itself after a week of purchase. Checked it with diffrent types of charger i.e with a fast charger and with a non fast charger hoping it was the fault of my charger. But it seems like this powerbank is at fault here.",
                "review_posted_date": "05 Sep 2018",
                "review_header": "Stopped charging itself after a week of usage",
                "review_rating": "1.0 ",
                "review_author": "Md zeeshan"
            },
            {
                "review_comment_count": "",
                "review_text": "After getting so many powerbanks, I found this Mi PowerBank 2i my best powerbank ever. I have been using a Samsung C9 Pro for the last 6 months and has a fast charging support. From the date of purchsse I was searching for a powerbank that gives an output of fast charging. Also this powerbank itself can charge faster using a fastcharging adapter. The ratings of the powerbank are mention below Input : Micro USB 5v at 2A 9v at 2A (Fast Charge) Output : USB A 5v at 2.4A 9v at 2.4A ( Fast Charge) 12v at 2.4A (Fastest Charge) Actual Capacity : 6500 mAh",
                "review_posted_date": "12 Oct 2018",
                "review_header": "The only powerbank that provides fastcharging",
                "review_rating": "5.0 ",
                "review_author": "Sayan Saha"
            }
        ],
        "url": "http://www.amazon.in/gp/product/B077RV8CCY",
        "price": " 699.00",
        "name": "Mi 10000mAH Li-Polymer Power Bank 2i (Blue)"
    }
]